app/controllers/notes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."slug" IS NULL LIMIT $1  [["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 3]]
---
  def show
    @note = Note.find_by slug: params[:slug]
    if @note.nil?
      render "note_gone"
    else
      @note.destroy

INSERT INTO "notes" ("message", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["message", "asddas"], ["created_at", "2017-11-05 18:51:10.945237"], ["updated_at", "2017-11-05 18:51:10.945237"]]
---
  def create
    if request.content_type =~ /xml/
      params[:message] = Hash.from_xml(request.body.read)["message"]
      ting = Note.create(content: params[:message])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_note
      @note = Note.find(params[:slug])